In [1]:
#Read the following data set:
#https://archive.ics.uci.edu/ml/machine-learning-databases/adult/
#Rename the columns as per the description from this file:
#https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.names
#Task:
#Create a sql db from adult dataset and name it sqladb
#4. Are there any people who are married, working in private sector and having a masters degree

In [2]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series
import sqlite3 as db

In [3]:
url = "https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data"
col_list = ['age','workclass','fnlwgt','education','education-num','marital-status','occupation',
           'relationship','race','sex','capital-gain','capital-loss','hours-per-week','native-country','Label']
adult = pd.read_csv(url,sep=",",delimiter=",",names=col_list,skipinitialspace=True)
sqladb = adult.copy()

In [4]:
from pandasql import sqldf
pysqldf = lambda q: sqldf(q, globals())

In [9]:
q = """ 
 select count(*) as "Married-and-masters" from sqladb WHERE "marital-status" != 'Never-married' and education = 'Masters' and workclass = 'Private';
"""
pysqldf(q)

   Married-and-masters
0                  660